Duet3D/Duet3Expansion/src/atmel/SAMDA1_DFP/1.2.50/samda1/atdf/ATSAMDA1J14A.atdf
        <register name="STATUS" offset="0xF" rw="R" size="1" initval="0x08" caption="Status">
          <bitfield name="STOP" caption="Stop" mask="0x8"/>
          <bitfield name="SLAVE" caption="Slave" mask="0x10"/>
          <bitfield name="SYNCBUSY" caption="Synchronization Busy" mask="0x80"/>
        </register>
        <register name="COUNT" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="COUNT32 Counter Value">
          <bitfield name="COUNT" caption="Count Value" mask="0xFFFFFFFF"/>
        </register>
        <register name="CC" offset="0x18" rw="RW" size="4" count="2" initval="0x00000000" caption="COUNT32 Compare/Capture">
          <bitfield name="CC" caption="Compare/Capture Value" mask="0xFFFFFFFF"/>
        </register>
      </register-group>
      <value-group name="TC_CTRLA__MODE">
        <value name="COUNT16" caption="Counter in 16-bit mode" value="0"/>
        <value name="COUNT8" caption="Counter in 8-bit mode" value="1"/>
        <value name="COUNT32" caption="Counter in 32-bit mode" value="2"/>
      </value-group>
      <value-group name="TC_CTRLA__PRESCALER">
        <value name="DIV1" caption="Prescaler: GCLK_TC" value="0x0"/>
        <value name="DIV2" caption="Prescaler: GCLK_TC/2" value="0x1"/>
        <value name="DIV4" caption="Prescaler: GCLK_TC/4" value="0x2"/>
        <value name="DIV8" caption="Prescaler: GCLK_TC/8" value="0x3"/>
        <value name="DIV16" caption="Prescaler: GCLK_TC/16" value="0x4"/>
        <value name="DIV64" caption="Prescaler: GCLK_TC/64" value="0x5"/>
        <value name="DIV256" caption="Prescaler: GCLK_TC/256" value="0x6"/>
        <value name="DIV1024" caption="Prescaler: GCLK_TC/1024" value="0x7"/>
      </value-group>
      <value-group name="TC_CTRLA__PRESCSYNC">
        <value name="GCLK" caption="Reload or reset the counter on next generic clock" value="0"/>
        <value name="PRESC" caption="Reload or reset the counter on next prescaler clock" value="1"/>
        <value name="RESYNC" caption="Reload or reset the counter on next generic clock. Reset the prescaler counter" value="2"/>
      </value-group>
      <value-group name="TC_CTRLA__WAVEGEN">
        <value name="NFRQ" value="0"/>
        <value name="MFRQ" value="1"/>
        <value name="NPWM" value="2"/>
        <value name="MPWM" value="3"/>
      </value-group>
      <value-group name="TC_CTRLBCLR__CMD">
        <value name="NONE" caption="No action" value="0"/>
        <value name="RETRIGGER" caption="Force a start, restart or retrigger" value="1"/>
        <value name="STOP" caption="Force a stop" value="2"/>
      </value-group>
      <value-group name="TC_CTRLBSET__CMD">
        <value name="NONE" caption="No action" value="0x0"/>
        <value name="RETRIGGER" caption="Force a start, restart or retrigger" value="0x1"/>
        <value name="STOP" caption="Force a stop" value="0x2"/>
      </value-group>
      <value-group name="TC_EVCTRL__EVACT">
        <value name="OFF" caption="Event action disabled" value="0"/>
        <value name="RETRIGGER" caption="Start, restart or retrigger TC on event" value="1"/>
        <value name="COUNT" caption="Count on event" value="2"/>
        <value name="START" caption="Start TC on event" value="3"/>
        <value name="PPW" caption="Period captured in CC0, pulse width in CC1" value="5"/>
        <value name="PWP" caption="Period captured in CC1, pulse width in CC0" value="6"/>
      </value-group>
    </module>
    <module name="TCC" id="U2213" version="1.2.2" caption="Timer Counter Control">
      <register-group name="TCC" caption="Timer Counter Control">
        <register name="CTRLA" offset="0x0" rw="RW" access="WSYNC" size="4" initval="0x00000000" caption="Control A">
          <bitfield name="SWRST" caption="Software Reset" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable" mask="0x2"/>
          <bitfield name="RESOLUTION" caption="Enhanced Resolution" mask="0x60" values="TCC_CTRLA__RESOLUTION"/>
          <bitfield name="PRESCALER" caption="Prescaler" mask="0x700" values="TCC_CTRLA__PRESCALER"/>
          <bitfield name="RUNSTDBY" caption="Run in Standby" mask="0x800"/>
          <bitfield name="PRESCSYNC" caption="Prescaler and Counter Synchronization Selection" mask="0x3000" values="TCC_CTRLA__PRESCSYNC"/>
          <bitfield name="ALOCK" caption="Auto Lock" mask="0x4000"/>
          <bitfield name="CPTEN0" caption="Capture Channel 0 Enable" mask="0x1000000"/>
          <bitfield name="CPTEN1" caption="Capture Channel 1 Enable" mask="0x2000000"/>
          <bitfield name="CPTEN2" caption="Capture Channel 2 Enable" mask="0x4000000"/>
          <bitfield name="CPTEN3" caption="Capture Channel 3 Enable" mask="0x8000000"/>
        </register>
        <register name="CTRLBCLR" offset="0x4" rw="RW" access="RWSYNC" size="1" atomic-op="clear:CTRLBCLR" initval="0x00" caption="Control B Clear">
          <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
          <bitfield name="LUPD" caption="Lock Update" mask="0x2"/>
          <bitfield name="ONESHOT" caption="One-Shot" mask="0x4"/>
          <bitfield name="IDXCMD" caption="Ramp Index Command" mask="0x18" values="TCC_CTRLBCLR__IDXCMD"/>
          <bitfield name="CMD" caption="TCC Command" mask="0xE0" values="TCC_CTRLBCLR__CMD"/>
        </register>
        <register name="CTRLBSET" offset="0x5" rw="RW" access="RWSYNC" size="1" atomic-op="set:CTRLBSET" initval="0x00" caption="Control B Set">
          <bitfield name="DIR" caption="Counter Direction" mask="0x1"/>
          <bitfield name="LUPD" caption="Lock Update" mask="0x2"/>
          <bitfield name="ONESHOT" caption="One-Shot" mask="0x4"/>
          <bitfield name="IDXCMD" caption="Ramp Index Command" mask="0x18" values="TCC_CTRLBSET__IDXCMD"/>
          <bitfield name="CMD" caption="TCC Command" mask="0xE0" values="TCC_CTRLBSET__CMD"/>
        </register>
        <register name="SYNCBUSY" offset="0x8" rw="R" size="4" initval="0x00000000" caption="Synchronization Busy">
          <bitfield name="SWRST" caption="Swrst Busy" mask="0x1"/>
          <bitfield name="ENABLE" caption="Enable Busy" mask="0x2"/>
          <bitfield name="CTRLB" caption="Ctrlb Busy" mask="0x4"/>
          <bitfield name="STATUS" caption="Status Busy" mask="0x8"/>
          <bitfield name="COUNT" caption="Count Busy" mask="0x10"/>
          <bitfield name="PATT" caption="Pattern Busy" mask="0x20"/>
          <bitfield name="WAVE" caption="Wave Busy" mask="0x40"/>
          <bitfield name="PER" caption="Period busy" mask="0x80"/>
          <bitfield name="CC0" caption="Compare Channel 0 Busy" mask="0x100"/>
          <bitfield name="CC1" caption="Compare Channel 1 Busy" mask="0x200"/>
          <bitfield name="CC2" caption="Compare Channel 2 Busy" mask="0x400"/>
          <bitfield name="CC3" caption="Compare Channel 3 Busy" mask="0x800"/>
          <bitfield name="PATTB" caption="Pattern Buffer Busy" mask="0x10000"/>
          <bitfield name="WAVEB" caption="Wave Buffer Busy" mask="0x20000"/>
          <bitfield name="PERB" caption="Period Buffer Busy" mask="0x40000"/>
          <bitfield name="CCB0" caption="Compare Channel Buffer 0 Busy" mask="0x80000"/>
          <bitfield name="CCB1" caption="Compare Channel Buffer 1 Busy" mask="0x100000"/>
          <bitfield name="CCB2" caption="Compare Channel Buffer 2 Busy" mask="0x200000"/>
          <bitfield name="CCB3" caption="Compare Channel Buffer 3 Busy" mask="0x400000"/>
        </register>
        <register name="FCTRLA" offset="0xC" rw="RW" size="4" initval="0x00000000" caption="Recoverable Fault A Configuration">
          <bitfield name="SRC" caption="Fault A Source" mask="0x3" values="TCC_FCTRLA__SRC"/>
          <bitfield name="KEEP" caption="Fault A Keeper" mask="0x8"/>
          <bitfield name="QUAL" caption="Fault A Qualification" mask="0x10"/>
          <bitfield name="BLANK" caption="Fault A Blanking Mode" mask="0x60" values="TCC_FCTRLA__BLANK"/>
          <bitfield name="RESTART" caption="Fault A Restart" mask="0x80"/>
          <bitfield name="HALT" caption="Fault A Halt Mode" mask="0x300" values="TCC_FCTRLA__HALT"/>
          <bitfield name="CHSEL" caption="Fault A Capture Channel" mask="0xC00" values="TCC_FCTRLA__CHSEL"/>
          <bitfield name="CAPTURE" caption="Fault A Capture Action" mask="0x7000" values="TCC_FCTRLA__CAPTURE"/>
          <bitfield name="BLANKVAL" caption="Fault A Blanking Time" mask="0xFF0000"/>
          <bitfield name="FILTERVAL" caption="Fault A Filter Value" mask="0xF000000"/>
        </register>
        <register name="FCTRLB" offset="0x10" rw="RW" size="4" initval="0x00000000" caption="Recoverable Fault B Configuration">
          <bitfield name="SRC" caption="Fault B Source" mask="0x3" values="TCC_FCTRLB__SRC"/>
          <bitfield name="KEEP" caption="Fault B Keeper" mask="0x8"/>
          <bitfield name="QUAL" caption="Fault B Qualification" mask="0x10"/>
          <bitfield name="BLANK" caption="Fault B Blanking Mode" mask="0x60" values="TCC_FCTRLB__BLANK"/>
          <bitfield name="RESTART" caption="Fault B Restart" mask="0x80"/>
          <bitfield name="HALT" caption="Fault B Halt Mode" mask="0x300" values="TCC_FCTRLB__HALT"/>
          <bitfield name="CHSEL" caption="Fault B Capture Channel" mask="0xC00" values="TCC_FCTRLB__CHSEL"/>
          <bitfield name="CAPTURE" caption="Fault B Capture Action" mask="0x7000" values="TCC_FCTRLB__CAPTURE"/>
          <bitfield name="BLANKVAL" caption="Fault B Blanking Time" mask="0xFF0000"/>
          <bitfield name="FILTERVAL" caption="Fault B Filter Value" mask="0xF000000"/>
        </register>
        <register name="WEXCTRL" offset="0x14" rw="RW" size="4" initval="0x00000000" caption="Waveform Extension Configuration">
          <bitfield name="OTMX" caption="Output Matrix" mask="0x3"/>
          <bitfield name="DTIEN0" caption="Dead-time Insertion Generator 0 Enable" mask="0x100"/>
          <bitfield name="DTIEN1" caption="Dead-time Insertion Generator 1 Enable" mask="0x200"/>
          <bitfield name="DTIEN2" caption="Dead-time Insertion Generator 2 Enable" mask="0x400"/>
          <bitfield name="DTIEN3" caption="Dead-time Insertion Generator 3 Enable" mask="0x800"/>
          <bitfield name="DTLS" caption="Dead-time Low Side Outputs Value" mask="0xFF0000"/>
          <bitfield name="DTHS" caption="Dead-time High Side Outputs Value" mask="0xFF000000"/>
        </register>
        <register name="DRVCTRL" offset="0x18" rw="RW" size="4" initval="0x00000000" caption="Driver Control">
          <bitfield name="NRE0" caption="Non-Recoverable State 0 Output Enable" mask="0x1"/>
          <bitfield name="NRE1" caption="Non-Recoverable State 1 Output Enable" mask="0x2"/>
          <bitfield name="NRE2" caption="Non-Recoverable State 2 Output Enable" mask="0x4"/>
          <bitfield name="NRE3" caption="Non-Recoverable State 3 Output Enable" mask="0x8"/>
          <bitfield name="NRE4" caption="Non-Recoverable State 4 Output Enable" mask="0x10"/>
          <bitfield name="NRE5" caption="Non-Recoverable State 5 Output Enable" mask="0x20"/>
          <bitfield name="NRE6" caption="Non-Recoverable State 6 Output Enable" mask="0x40"/>
          <bitfield name="NRE7" caption="Non-Recoverable State 7 Output Enable" mask="0x80"/>
          <bitfield name="NRV0" caption="Non-Recoverable State 0 Output Value" mask="0x100"/>
          <bitfield name="NRV1" caption="Non-Recoverable State 1 Output Value" mask="0x200"/>
          <bitfield name="NRV2" caption="Non-Recoverable State 2 Output Value" mask="0x400"/>
          <bitfield name="NRV3" caption="Non-Recoverable State 3 Output Value" mask="0x800"/>
          <bitfield name="NRV4" caption="Non-Recoverable State 4 Output Value" mask="0x1000"/>
          <bitfield name="NRV5" caption="Non-Recoverable State 5 Output Value" mask="0x2000"/>
          <bitfield name="NRV6" caption="Non-Recoverable State 6 Output Value" mask="0x4000"/>
          <bitfield name="NRV7" caption="Non-Recoverable State 7 Output Value" mask="0x8000"/>
          <bitfield name="INVEN0" caption="Output Waveform 0 Inversion" mask="0x10000"/>
          <bitfield name="INVEN1" caption="Output Waveform 1 Inversion" mask="0x20000"/>
          <bitfield name="INVEN2" caption="Output Waveform 2 Inversion" mask="0x40000"/>
          <bitfield name="INVEN3" caption="Output Waveform 3 Inversion" mask="0x80000"/>
          <bitfield name="INVEN4" caption="Output Waveform 4 Inversion" mask="0x100000"/>
          <bitfield name="INVEN5" caption="Output Waveform 5 Inversion" mask="0x200000"/>
          <bitfield name="INVEN6" caption="Output Waveform 6 Inversion" mask="0x400000"/>
          <bitfield name="INVEN7" caption="Output Waveform 7 Inversion" mask="0x800000"/>
          <bitfield name="FILTERVAL0" caption="Non-Recoverable Fault Input 0 Filter Value" mask="0xF000000"/>
          <bitfield name="FILTERVAL1" caption="Non-Recoverable Fault Input 1 Filter Value" mask="0xF0000000"/>
        </register>
        <register name="DBGCTRL" offset="0x1E" rw="RW" size="1" initval="0x00" caption="Debug Control">
          <bitfield name="DBGRUN" caption="Debug Running Mode" mask="0x1"/>
          <bitfield name="FDDBD" caption="Fault Detection on Debug Break Detection" mask="0x4"/>
        </register>
